# -*- coding: utf-8 -*-
"""
Created on Sat Jul  1 16:14:25 2023

@author: TEJA
"""

print("current status: loading vocabulary")

START = ''
PADDING = ''
END = ''

telugu_vocabulary = [ START,'', ' ', '!', '"', '#', '$', '%', '&', "'", '(', ')', '*', '+', ',', '-', '.', '/','“','”','‘','’', 
                       '౦' , '౧', '౨', '౩', '౪', '౫', '౬', '౭', '౮' , '౯',
            '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',
                       ':', '<', '=', '>', '?', '@',
                       'అ', 'ఆ', 'ఇ', 'ఈ', 'ఉ', 'ఊ', 'ఋ', 'ఎ', 'ఏ', 'ఐ', 'ఒ', 'ఓ', 'ఔ',
                       'క', 'ఖ', 'గ', 'ఘ', 'ఙ',
                       'చ', 'ఛ', 'జ', 'ఝ', 'ఞ',
                       'ట', 'ఠ', 'డ', 'ఢ', 'ణ',
                       'త', 'థ', 'ద','ధ', 'న',
                       'ప', 'ఫ', 'బ','భ', 'మ',
                       'య', 'ర', 'ల', 'వ', 'శ', 'ష', 'స', 'హ', 'ళ', 'క్ష', 'ఱ',
                       '[', '\\', 
                       ']', '^', '_', 
                       '`', 
                       'ా', 'ి', 'ీ', 'ు', 'ూ', 'ృ', 'ె', 'ే', 'ై', 'ొ', 'ో', 'ౌ', '్', 'ౘ', 'ౙ', 'ౚ', 'ౠ', 'ౡ', 'ౢ', 'ౣ', 'ం', 'ః', 'ౖ',
                       '{', '|', '}', '~', PADDING, END]

index_to_tel = {k:v for k,v in enumerate(telugu_vocabulary)}
tel_to_index = {v:k for k,v in enumerate(telugu_vocabulary)}
